ansible
atk
autoconf
cairo
ctags
doxygen
elixir-build
emacs
emojify
erlang
exenv
fontconfig
freetype
fzf
gawk
gdbm
gdk-pixbuf
gettext
ghq
git
glib
gmp
go
gobject-introspection
graphviz
gtk+
harfbuzz
hicolor-icon-theme
hub
icu4c
imagemagick
jpeg
less
libcroco
libevent
libffi
libpng
librsvg
libtiff
libtool
libyaml
little-cms2
lua
mpfr
nkf
nodebrew
openjpeg
openssl
pango
pcre
perl
phantomjs
pixman
pkg-config
poppler
postgresql
python
rbenv
rbenv-default-gems
readline
redis
ruby
ruby-build
shared-mime-info
sqlite
the_silver_searcher
tig
tmux
tree
utf8proc
vim
wxmac
xz
zsh
