# 2022年時点の brew_list.txt / brew_cask_list.txt を棚卸しして Brewfile 化したもの(2026-07)。
# 次に Mac をセットアップするときは `brew bundle --file mac/Brewfile` で導入し、
# 実際に使うものが固まったら `brew bundle dump` で作り直す。
#
# 元リストから除外したもの:
#   - ライブラリ類(cairo, glib, openssl, readline など): 依存として自動で入るため
#   - rbenv / ruby-build / nodebrew / exenv / elixir-build / erlang / go / ruby / python
#     / ghq / neovim: asdf (.tool-versions) 管理に移行済み
#   - phantomjs: 開発終了
#   - skype: サービス終了
#   - imagemagick / gawk / nkf / tig / tree / emacs / emojify / less / alfred: 必要になったら入れる
#     (less は macOS 標準のものが古くて困った場合のみ)

# CLI
brew "asdf"                 # .zshrc が brew --prefix asdf を前提にしている
brew "autoconf"             # asdf での Ruby ビルドに必要
brew "colima"               # docker デーモン用の VM(Docker Desktop は使わない)
brew "ctags"
brew "docker"               # CLI クライアントのみ。デーモンは colima で起動する
brew "docker-compose"       # `docker compose` で呼ぶには ~/.docker/config.json の cliPluginsExtraDirs 設定が必要(brew info docker-compose 参照)
brew "fzf"
brew "gh"                   # hub から置き換え
brew "git"
brew "graphviz"
brew "postgresql"
brew "redis"
brew "ripgrep"              # the_silver_searcher (ag) から乗り換え
brew "tmux"
brew "zsh"

# GUI アプリ
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
